# PANDAS
## Pandas ia an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the python programming language.

## Agenda
- What is Data Frames?
- What is Data Series?
- Different operation in Pandas

In [1]:
# First step is to import pandas

import pandas as pd
import numpy as np

In [2]:
# Playing with dataframe

df = pd.DataFrame(np.arange(0, 20).reshape(5,4),index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Column1', 'Column2', 'Column3', 'Column4'])

In [18]:
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int64

In [19]:
type(df['Column3'])

pandas.core.series.Series

In [21]:
df[['Column1', 'Column4']] # For getting multiple columns we need to create a list

      Column1  Column4
Row1        0        3
Row2        4        7
Row3        8       11
Row4       12       15
Row5       16       19

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.to_csv('Test1.csv')

In [5]:
# Accessing the elements
# 1. .loc   2.  .iloc

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
df.iloc[0:2,0:4]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [9]:
# Check type
type(df.iloc[0:2,0:4])

pandas.core.frame.DataFrame

In [10]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: Column1, dtype: int64

In [11]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [12]:
# Take the elements from the column2

df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [13]:
# Convert DataFrames into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [14]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [15]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [16]:
df['Column1'].value_counts()

Column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [17]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])